USE olivia;

INSERT INTO course_score (student_id, course_arrangement_id, course_score) VALUES 
(1, 1, 77.7), -- 張飛, 微積分
(3, 1, 56.0), -- 周瑜, 微積分
(4, 1, 34.0), -- 黃蓋, 微積分
(5, 1, 98.0), -- 趙雲, 微積分
(6, 1, 55.0), -- 關興, 微積分
(7, 1, 67.0), -- 夏侯惇, 微積分
(9, 2, 66.0), -- 關羽, 計算機概論
(3, 2, 93.0), -- 周瑜, 計算機概論 (重複)
(4, 2, 44.0), -- 黃蓋, 計算機概論 (重複)
(5, 2, 49.0), -- 趙雲, 計算機概論 (重複)
(7, 2, 78.0), -- 夏侯惇, 計算機概論 (重複)
(11, 2, 74.0), -- 華陀, 計算機概論
(1, 3, 46.0), -- 張飛, 統計學習
(4, 3, 76.0), -- 黃蓋, 統計學習 (重複)
(6, 3, 87.0), -- 關興, 統計學習 (重複)
(13, 3, 76.0), -- 呂布, 統計學習
(11, 3, 80.0), -- 華陀, 統計學習 (重複)
(14, 3, 78.0), -- 諸葛亮, 統計學習
(15, 3, 65.0), -- 呂蒙, 統計學習
(16, 3, 99.0), -- 圖靈, 統計學習
(17, 3, 69.0), -- 巴斯卡, 統計學習
(1, 4, 56.0), -- 張飛, 經濟學
(4, 4, 67.5), -- 黃蓋, 經濟學 (重複)
(5, 4, 78.0), -- 趙雲, 經濟學 (重複)
(7, 4, 89.0), -- 夏侯惇, 經濟學 (重複)
(13, 4, 45.0), -- 呂布, 經濟學 (重複)
(9, 5, 68.7), -- 關羽, 統計學
(18, 5, 63.0), -- 大喬, 統計學
(19, 5, 46.0), -- 甘寧, 統計學
(3, 5, 78.0), -- 周瑜, 統計學 (重複)
(4, 5, 87.0), -- 黃蓋, 統計學 (重複)
(12, 5, 96.0), -- 劉備, 統計學
(1, 6, 34.0), -- 張飛, 音樂欣賞
(4, 6, 80.0), -- 黃蓋, 音樂欣賞 (重複)
(6, 6, 62.0), -- 關興, 音樂欣賞 (重複)
(7, 6, 60.0), -- 夏侯惇, 音樂欣賞 (重複)
(12, 6, 56.0), -- 劉備, 音樂欣賞 (重複)
(11, 6, 98.0), -- 華陀, 音樂欣賞 (重複)
(14, 6, 55.0), -- 諸葛亮, 音樂欣賞 (重複)
(15, 6, 78.0), -- 呂蒙, 音樂欣賞 (重複)
(13, 7, 79.0), -- 呂布, 演算法
(20, 7, 87.0), -- 郭嘉, 演算法
(11, 7, 68.0), -- 華陀, 演算法 (重複)
(16, 7, 99.0), -- 圖靈, 演算法 (重複)
(17, 7, 69.0); -- 巴斯卡, 演算法 (重複)
