USE olivia;
INSERT INTO course_feedback (student_id, course_arrangement_id, feedback_rank) VALUES 
(1, 1, 1), -- 張飛, 微積分
(3, 1, 2), -- 周瑜, 微積分
(4, 1, 3), -- 黃蓋, 微積分
(5, 1, 4), -- 趙雲, 微積分
(6, 1, 5), -- 關興, 微積分
(7, 1, 2), -- 夏侯惇, 微積分
(9, 2, 3), -- 關羽, 計算機概論
(3, 2, 4), -- 周瑜, 計算機概論 (重複)
(4, 2, 4), -- 黃蓋, 計算機概論 (重複)
(5, 2, 5), -- 趙雲, 計算機概論 (重複)
(7, 2, 3), -- 夏侯惇, 計算機概論 (重複)
(11, 2, 5), -- 華陀, 計算機概論 (重複)
(1, 3, 5), -- 張飛, 統計學習
(4, 3, 4), -- 黃蓋, 統計學習 (重複)
(6, 3, 5), -- 關興, 統計學習 (重複)
(13, 3, 4), -- 呂布, 統計學習
(11, 3, 5), -- 華陀, 統計學習 (重複)
(14, 3, 3), -- 諸葛亮, 統計學習
(15, 3, 4), -- 呂蒙, 統計學習
(16, 3, 3), -- 圖靈, 統計學習
(17, 3, 1), -- 巴斯卡, 統計學習
(1, 4, 3), -- 張飛, 經濟學
(4, 4, 5), -- 黃蓋, 經濟學 (重複)
(5, 4, 4), -- 趙雲, 經濟學 (重複)
(7, 4, 2), -- 夏侯惇, 經濟學 (重複)
(13, 4, 5), -- 呂布, 經濟學 (重複)
(9, 5, 1), -- 關羽, 統計學
(18, 5, 4), -- 大喬, 統計學
(19, 5, 5), -- 甘寧, 統計學
(3, 5, 2), -- 周瑜, 統計學 (重複)
(4, 5, 3), -- 黃蓋, 統計學 (重複)
(12, 5, 2), -- 劉備, 統計學
(1, 6, 3), -- 張飛, 音樂欣賞
(4, 6, 4), -- 黃蓋, 音樂欣賞 (重複)
(6, 6, 5), -- 關興, 音樂欣賞 (重複)
(7, 6, 3), -- 夏侯惇, 音樂欣賞 (重複)
(12, 6, 5), -- 劉備, 音樂欣賞 (重複)
(11, 6, 4), -- 華陀, 音樂欣賞 (重複)
(14, 6, 5), -- 諸葛亮, 音樂欣賞 (重複)
(15, 6, 5), -- 呂蒙, 音樂欣賞 (重複)
(13, 7, 5), -- 呂布, 演算法
(20, 7, 4), -- 郭嘉, 演算法
(11, 7, 3), -- 華陀, 演算法 (重複)
(16, 7, 3), -- 圖靈, 演算法 (重複)
(17, 7, 1); -- 巴斯卡, 演算法 (重複)
