USE olivia;

-- 插入 student 資料
INSERT INTO student (student_id, student_name, student_dept, student_grade, student_status, student_class) VALUES 
(1, '張飛', '數學系', 1, '在學', 'A'),
(2, '孫尚香', '數學系', 1, '休學', 'A'),
(3, '周瑜', '數學系', 1, '在學', 'A'),
(4, '黃蓋', '數學系', 1, '在學', 'A'),
(5, '趙雲', '數學系', 1, '在學', 'A'),
(6, '關興', '數學系', 1, '在學', 'A'),
(7, '夏侯惇', '數學系', 1, '在學', 'A'),
(8, '龐統', '資訊工程系', 1, '休學', 'A'),
(9, '關羽', '資訊工程系', 1, '在學', 'A'),
(10, '華雄', '資訊工程研究所', 1, '退學', 'A'),
(11, '華陀', '資訊工程研究所', 1, '在學', 'A'),
(12, '劉備', '資訊管理系', 1, '在學', 'A'),
(13, '呂布', '資訊工程研究所', 1, '在學', 'A'),
(14, '諸葛亮', '資訊工程研究所', 1, '在學', 'A'),
(15, '呂蒙', '資訊工程研究所', 1, '在學', 'A'),
(16, '圖靈', '數學系碩士班', 1, '在學', 'A'),
(17, '巴斯卡', '數學系碩士班', 1, '在學', 'A'),
(18, '大喬', '資訊工程系', 1, '在學', 'A'),
(19, '甘寧', '資訊工程系', 1, '在學', 'A'),
(20, '司馬昭', '資訊工程系', 1, '在學', 'A'),
(21, '馬超', '資訊工程系', 1, '在學', 'A');
