INSERT INTO enrollment (student_id, course_arrangement_id, select_result) VALUES 
(1, 1, '中選'), -- 張飛
(2, 1, '中選'), -- 孫尚香
(3, 1, '中選'), -- 周瑜
(4, 1, '中選'), -- 黃蓋
(5, 1, '中選'), -- 趙雲
(6, 1, '中選'), -- 關興
(7, 1, '中選'), -- 夏侯惇
(8, 1, '中選'), -- 龐統
(9, 2, '中選'), -- 關羽
(8, 2, '中選'), -- 龐統 (重複，因為是休學)
(3, 2, '中選'), -- 周瑜 (重複)
(4, 2, '中選'), -- 黃蓋 (重複)
(5, 2, '中選'), -- 趙雲 (重複)
(7, 2, '中選'), -- 夏侯惇 (重複)
(10, 2, '中選'), -- 華雄
(11, 2, '中選'), -- 華陀
(8, 3, '中選'), -- 龐統 (重複)
(1, 3, '中選'), -- 張飛 (重複)
(4, 3, '中選'), -- 黃蓋 (重複)
(6, 3, '中選'), -- 關興 (重複)
(12, 3, '落選'), -- 劉備
(10, 3, '中選'), -- 華雄 (重複)
(13, 3, '中選'), -- 呂布
(11, 3, '中選'), -- 華陀 (重複)
(14, 3, '中選'), -- 諸葛亮
(15, 3, '中選'), -- 呂蒙
(16, 3, '中選'), -- 圖靈
(17, 3, '人工加選'), -- 巴斯卡
(8, 4, '落選'), -- 龐統 (重複)
(1, 4, '中選'), -- 張飛 (重複)
(2, 4, '中選'), -- 孫尚香 (重複)
(4, 4, '中選'), -- 黃蓋 (重複)
(5, 4, '中選'), -- 趙雲 (重複)
(7, 4, '中選'), -- 夏侯惇 (重複)
(13, 4, '中選'), -- 呂布 (重複)
(9, 5, '中選'), -- 關羽 (重複)
(18, 5, '中選'), -- 大喬
(19, 5, '中選'), -- 甘寧
(2, 5, '中選'), -- 孫尚香 (重複)
(3, 5, '中選'), -- 周瑜 (重複)
(4, 5, '中選'), -- 黃蓋 (重複)
(12, 5, '中選'), -- 劉備 (重複)
(9, 6, '中選'), -- 關羽 (重複)
(8, 6, '中選'), -- 龐統 (重複)
(20, 6, '落選'), -- 司馬昭
(21, 6, '落選'), -- 馬超
(1, 6, '中選'), -- 張飛 (重複)
(2, 6, '落選'), -- 孫尚香 (重複)
(3, 6, '落選'), -- 周瑜 (重複)
(4, 6, '中選'), -- 黃蓋 (重複)
(6, 6, '中選'), -- 關興 (重複)
(7, 6, '中選'), -- 夏侯惇 (重複)
(12, 6, '中選'), -- 劉備 (重複)
(10, 6, '中選'), -- 華雄 (重複)
(11, 6, '中選'), -- 華陀 (重複)
(14, 6, '中選'), -- 諸葛亮 (重複)
(15, 6, '中選'), -- 呂蒙 (重複)
(16, 6, '中選'), -- 圖靈 (重複)
(17, 6, '中選'), -- 巴斯卡 (重複)
(1, 7, '落選'), -- 張飛 (重複)
(10, 7, '中選'), -- 華雄 (重複)
(13, 7, '中選'), -- 呂布 (重複)
(20, 7, '中選'), -- 司馬昭 (重複)
(11, 7, '中選'), -- 華陀 (重複)
(8, 7, '休學'), -- 龐統 (重複)
(16, 7, '中選'), -- 圖靈 (重複)
(17, 7, '中選'); -- 巴斯卡 (重複)
